CREATE TABLE test_table (
    name VARCHAR(10) CHECK (LENGTH(name) BETWEEN 4 AND 10),
    surname VARCHAR(50),
    city VARCHAR(50),
    age INTEGER CHECK (age > 0 AND age <= 150)
);

INSERT INTO test_table (name, surname, city, age)
VALUES
    ('Иван', 'Иванов', 'Москва', 35),
    ('Ольга', 'Смирнова', 'Санкт-Петербург', 28),
    ('Никита', 'Иванов', 'Новосибирск', 42),
    ('Алина', 'Вильямс', 'Санкт-Петербур', 31),
    ('Тимур', 'Артуров', 'Москва', 27),
    ('Егор', 'Петров', 'Киров', 24),
    ('Камила', 'Руднина', 'Нижний Новгород', 39),
    ('Оксана', 'Тишкина', 'Новосибирск', 25),
    ('Никита', 'Петров', 'Санкт-Петербур', 33),
    ('Артем', 'Иванов', 'Москва', 29),
    ('Луиза', 'Ли', 'Псков', 38),
    ('Евграфья', 'Флокс', 'Киров', 26),
    ('Нуан', 'Малкина', 'Санкт-Петербур', 41),
    ('Мианна', 'Джонсова', 'Москва', 30),
    ('Кирилл', 'Моцарело', 'Орел', 37),
    ('Гарпия', 'Иванова', 'Москва', 23),
    ('Оливет', 'Твист', 'Выборг', 34),
    ('Есения', 'Браун', 'Санкт-Петербур', 28),
    ('Лиан', 'Ферерро', 'Москва', 32),
    ('София', 'Гудиер', 'Санкт-Петербур', 27);
